{
  "restaurants": {
    "mtr": {
      "id": "mtr",
      "name": "Mavalli Tiffin Rooms (MTR)",
      "description": "<p><strong>Since 1924</strong>, Mavalli Tiffin Rooms (MTR) has been a cornerstone of Bengaluru’s culinary heritage. Founded by the Maiya brothers from Udupi, it originally began as the Brahmin Coffee Club before being renamed MTR. Over the decades, MTR has become legendary not just for its food, but for its role in shaping South Indian breakfast culture.</p><p>MTR is famously credited with the invention of the <strong>Rava Idli</strong> during <strong>World War II</strong>, when rice was scarce due to wartime shortages. To adapt, they created a new recipe using semolina (rava), giving birth to what is now one of India’s most loved breakfast dishes.</p><p>Their <strong>Masala Dosa</strong> is iconic — thick, dark-roasted, crisp on the outside, and rich in flavor. Served with generous amounts of ghee, spicy potato filling, and their signature chutneys, it offers a taste that has remained unchanged for generations.</p>",
      "image": "https://th-i.thgim.com/public/incoming/85od6z/article67738832.ece/alternates/FREE_1200/mtr.jpg",
      "location": "https://maps.google.com/?q=MTR+Lalbagh+Road+Bengaluru"
    },
    "ctr": {
      "id": "ctr",
      "name": "CTR - Shri Sagar",
      "description": "<p><strong>Central Tiffin Room (CTR)</strong>, now known as Shri Sagar, is a pilgrimage site for dosa lovers in Malleshwaram. Famous for its <strong>Benne Masala Dosa</strong>, this 90-year-old establishment serves dosas that are the definition of \"crispy on the outside, soft on the inside.\"</p><p>The dosas here are known for their golden-brown, glass-like crunch, achieved by a generous slathering of butter (benne). They are traditionally wood-fired, giving them a distinct smoky aroma. Served with two types of chutney—coconut and spicy mint—CTR’s dosas are simple but unforgettable.</p>",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/97/0c/6e/caption.jpg?w=1100&h=1100&s=1",
      "location": "https://maps.google.com/?q=CTR+Malleshwaram+Bengaluru"
    },
    "vidyarthi-bhavan": {
      "id": "vidyarthi-bhavan",
      "name": "Vidyarthi Bhavan",
      "description": "<p>Established in <strong>1943</strong> in the heart of Gandhi Bazaar, <strong>Vidyarthi Bhavan</strong> started as a canteen for students (\"Vidyarthi\"). Today, it is a cultural landmark frequented by writers, politicians, and celebrities.</p><p>Their Masala Dosa is unique: thick, fatty, and distinctly brown, folded in half with a dollop of potato palya inside. The sight of waiters deftly balancing stacks of 10-15 dosa plates on one arm is almost as famous as the food itself. The rustic charm, old photographs on the walls, and the bustling energy make eating here a quintessential Bengaluru experience.</p>",
      "image": "https://i0.wp.com/lifeisavacation.in/wp-content/uploads/2016/09/VidyartiBhavan-Entrance.jpg?resize=700%2C394",
      "location": "https://maps.google.com/?q=Vidyarthi+Bhavan+Gandhi+Bazaar+Bengaluru"
    },
    "halli-mane": {
      "id": "halli-mane",
      "name": "Halli Mane",
      "description": "<p><strong>Halli Mane</strong>, meaning \"Village House,\" brings the rustic flavors of rural Karnataka to the city. Located in Malleshwaram, it is celebrated for its festive setting and traditional tile-roof ambiance.</p><p>While they serve a vast menu, their <strong>Bisi Bele Bath</strong> and <strong>Ragi Mudde</strong> are standouts. The food is authentically prepared using traditional spices and often served on banana leaves. It's one of the best places to experience a full traditional Karnataka meal (Oota) in a setting that feels like a home away from home.</p>",
      "image": "https://www.topbengaluru.com/wp-content/uploads/2024/04/Hallimane-Veg-Restaurant-1.jpg",
      "location": "https://maps.google.com/?q=Halli+Mane+Malleshwaram+Bengaluru"
    },
    "maiyas": {
      "id": "maiyas",
      "name": "Maiyas",
      "description": "<p>Founded by the descendants of the MTR family, <strong>Maiyas</strong> is a modern flagbearer of traditional South Indian cuisine. Their Jayanagar restaurant is a multi-story culinary haven.</p><p>Their <strong>Bisi Bele Bath</strong> is considered one of the best in the city—rich, perfectly spiced, and loaded with vegetables and cashew nuts, served with boondi for crunch. It strikes the perfect balance between spicy and tangy flavors that define the dish.</p>",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/15/42/3d/caption.jpg?w=1200&h=1200&s=1",
      "location": "https://maps.google.com/?q=Maiyas+Jayanagar+Bengaluru"
    },
    "meghana-foods": {
      "id": "meghana-foods",
      "name": "Meghana Foods",
      "description": "<p><strong>Meghana Foods</strong> is one of Bengaluru’s most popular spots for bold, spicy, and flavor-packed Andhra-style cuisine. What started as a humble eatery has now become a go-to destination for anyone craving rich, masala-heavy comfort food.</p><p>Their absolute must-try is the <strong>Boneless Chicken Biryani</strong> — intensely flavorful, perfectly spiced, and loaded with tender pieces of chicken. Every grain of rice is infused with deep masala, making it one of the most loved biryanis in the city.</p><p>Located across multiple buzzing neighborhoods of Bengaluru, Meghana Foods is known for its quick service, lively atmosphere, and consistent taste. It’s the kind of place people return to again and again when they want a hearty, no-nonsense meal that hits all the right spice notes.</p>",
      "image": "https://b.zmtcdn.com/data/pictures/4/19498304/976874f759886ec887422b5f6dba6004.jpg",
      "location": "https://maps.google.com/?q=Meghana+Foods+Koramangala+Bengaluru"
    },
    "nagarjuna": {
      "id": "nagarjuna",
      "name": "Nagarjuna",
      "description": "<p>Started in 1984, <strong>Nagarjuna</strong> is the go-to place for an authentic <strong>Andhra Meal</strong> on a banana leaf. Their \"Full Meals\" (Bhojanam) is an experience—unlimited rice, followed by hot ghee, spicy gun powder (podi), pappu (dal), and the famously spicy Andhra chicken curry.</p><p>Their Biryani is also a crowd favorite, known for its spicy kick. The restaurant is elegant yet efficient, known for its swift service and the famous \"shunti\" (ginger) chutney served with every meal.</p>",
      "image": "https://thefoodietravels.com/wp-content/uploads/2022/09/nagarjuna-restaurant-bangalore.jpg",
      "location": "https://maps.google.com/?q=Nagarjuna+Residency+Road+Bengaluru"
    },
    "rnr-biryani": {
      "id": "rnr-biryani",
      "name": "RNR Biryani",
      "description": "<p><strong>RNR Biryani</strong>, founded by sisters Ramya and Shwetha Ravi, is a tribute to their family’s culinary legacy and an authentic celebration of Karnataka’s famous <strong>Donne Biryani</strong>.</p><p>Their specialty is the traditional Naati-style Biryani, crafted using a cherished family recipe. Made with aromatic Jeeraga Samba rice and a flavorful, herb-rich green masala, every bite captures the rustic essence of Bangalore’s food heritage.</p><p>What makes RNR truly stand out is its unique <strong>blue tin-box packaging</strong> lined with a plantain leaf, ensuring the biryani stays fresh and aromatic. It’s more than just a meal; it’s a modern way to experience a centuries-old tradition.</p>",
      "image": "https://media-cdn.tripadvisor.com/media/photo-s/21/61/6a/c0/rnr-biryani-jayanagar.jpg",
      "location": "https://maps.google.com/?q=RNR+Biryani+Jayanagar+Bengaluru"
    },
    "mudde-madappa": {
      "id": "mudde-madappa",
      "name": "Mudde Madappa Mess",
      "description": "<p><strong>Mudde Madappa Mess</strong> in Gandhinagar is an institution dedicated to the humble <strong>Ragi Mudde</strong>. It is a no-frills, traditional mess that serves wholesome, homestyle food.</p><p>People flock here for the unlimited Ragi Mudde meals served with spicy Bassaru (greens and lentil curry) or Soppina Saaru. It’s widely regarded as one of the most authentic places to experience the staple diet of the Old Mysore region in its purest form.</p>",
      "image": "https://images.jdmagicbox.com/v2/comp/bangalore/12/080p4308912/catalogue/gandhinagar-mudde-madappa-boarding-and-restaurant-gandhi-nagar-bangalore-south-indian-restaurants-jqdonq3qez.jpg",
      "location": "https://maps.google.com/?q=Mudde+Madappa+Mess+Gandhinagar+Bengaluru"
    },
    "kamat-lokaruchi": {
      "id": "kamat-lokaruchi",
      "name": "Kamat Lokaruchi",
      "description": "<p>Located on the Bengaluru-Mysore highway, <strong>Kamat Lokaruchi</strong> is more than a restaurant; it's a cultural hub for travelers. It is famous for its elaborate buffet breakfasts and North Karnataka specialties.</p><p>It is one of the best places to try <strong>Ragi Mudde</strong> in a comfortable setting, often served with an array of chutneys, jaggery, and butter. Their \"Jolada Rotti Oota\" is another highlight, creating a rustic culinary journey.</p>",
      "image": "https://i.ytimg.com/vi/q1PwRufAqL0/maxresdefault.jpg",
      "location": "https://maps.google.com/?q=Kamat+Lokaruchi+Mysore+Road+Karnataka"
    },
    "brahmins-coffee-bar": {
      "id": "brahmins-coffee-bar",
      "name": "Brahmin's Coffee Bar",
      "description": "<p><strong>Established in 1965</strong>, Brahmin’s Coffee Bar in Shankarapura is a legendary name in Bengaluru’s breakfast scene, celebrated for its simplicity and unwavering focus on just a few classic dishes.</p><p>Their <strong>Idlis</strong> are famously soft and airy, while the <strong>Vadas</strong> are crisp on the outside and fluffy within, creating a perfect contrast of textures in every bite.</p><p>What truly sets this place apart is its iconic <strong>Coconut Chutney</strong>—light, minty, mildly spicy, and generously poured over the plate. With no sambar served here, the chutney takes center stage, making every visit a nostalgic taste of old Bangalore’s tiffin culture.</p>",
      "image": "https://www.sheknowsgrub.com/wp-content/uploads/2016/05/DSC_0703-1024x678.jpg",
      "location": "https://maps.google.com/?q=Brahmins+Coffee+Bar+Basavanagudi+Bengaluru"
    },
    "veena-stores": {
      "id": "veena-stores",
      "name": "Veena Stores",
      "description": "<p><strong>Established in 1977</strong>, Veena Stores in the heart of <strong>Malleshwaram</strong> is one of Bengaluru’s most loved breakfast spots, celebrated for its homely flavors, warm hospitality, and consistently comforting South Indian fare.</p><p>Their <strong>Idlis</strong> are soft, fluffy, and melt-in-the-mouth, while the <strong>Vadas</strong> are perfectly crisp with a light, airy center—making every plate a beautiful balance of textures and taste.</p><p>Set amid the tree-lined streets and old-world charm of Malleshwaram, Veena Stores feels like a neighborhood tradition rather than just a restaurant. With its rich sambar, fresh chutneys, and soulful cooking, it offers a deeply nostalgic experience that captures the true spirit of Bengaluru’s tiffin culture.</p>",
      "image": "https://images.jdmagicbox.com/v2/comp/bangalore/67/080p4311267/catalogue/veena-restaurant-malleswaram-bangalore-south-indian-restaurants-hlhhghwm1x.jpg",
      "location": "https://maps.google.com/?q=Veena+Stores+Malleshwaram+Bengaluru"
    },
    "taaza-thindi": {
      "id": "taaza-thindi",
      "name": "Taaza Thindi",
      "description": "<p><strong>Taaza Thindi</strong> in <strong>Jayanagar</strong> has become a modern-day icon in Bengaluru’s breakfast scene, loved for its fresh, affordable, and consistently delicious South Indian tiffin offerings.</p><p>Their <strong>Idlis</strong> are soft and pillowy, the <strong>Vadas</strong> are crisp and golden, and the dosas are perfectly roasted—each dish prepared fresh and served hot, making every bite simple yet deeply satisfying.</p><p>Located in the lively, tree-lined streets of Jayanagar, Taaza Thindi reflects the neighborhood’s energetic and community-driven spirit. With its bustling counters, quick service, and comforting flavors, it’s a place where locals gather daily, making it a must-visit for anyone exploring Bengaluru’s vibrant food culture.</p>",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/db/4b/a2/taaza-thindi.jpg?w=900&h=-1&s=1",
      "location": "https://maps.google.com/?q=Taaza+Thindi+Jayanagar+Bengaluru"
    },
    "indian-coffee-house": {
      "id": "indian-coffee-house",
      "name": "Indian Coffee House",
      "description": "<p>A slice of history on Church Street. With waitstaff in traditional uniforms, it's one of the most historic coffee houses in India.</p><p>Must-try: Their classic <strong>Filter Coffee</strong>, <strong>Vegetable Cutlet</strong>, and the <strong>Scrambled Eggs</strong>.</p>",
      "image": "https://media.assettype.com/deccanherald%2Fimport%2Fsites%2Fdh%2Ffiles%2Farticleimages%2F2023%2F01%2F12%2Ffile7ogh0yxzlr9z43tlo7d-1180507-1673546729.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
      "location": "https://maps.google.com/?q=Indian+Coffee+House+Church+Street+Bengaluru"
    },
    "by-2-coffee": {
      "id": "by-2-coffee",
      "name": "By 2 Coffee",
      "description": "<p>True to its name, this place offers affordable, high-quality filter coffee served in the traditional \"glass\" style. It's a localized favorite for a quick boost.</p><p>Must-try: The strong <strong>Filter Coffee</strong> and their crispy <strong>Masala Vada</strong>.</p>",
      "image": "https://i.ytimg.com/vi/clpqLaeVrJg/maxresdefault.jpg",
      "location": "https://maps.google.com/?q=By+2+Coffee+Bengaluru"
    },
    "koshys": {
      "id": "koshys",
      "name": "Koshy's",
      "description": "<p>A legendary meeting point for intellectuals and food lovers alike since 1952. <strong>Koshy's</strong> is a heritage restaurant with an unmatched vibe.</p><p>Must-try: <strong>Filter Coffee</strong>, <strong>Potato Smileys</strong>, and their famous <strong>Roast Chicken</strong>.</p>",
      "image": "https://assets.cntraveller.in/photos/61caaf2587570a0f23699304/3:2/w_1620,h_1080,c_limit/Koshys%20Bengaluru.jpg",
      "location": "https://maps.google.com/?q=Koshy's+St.+Marks+Road+Bengaluru"
    },
    "shivaji-military-hotel": {
      "id": "shivaji-military-hotel",
      "name": "Shivaji Military Hotel",
      "description": "<p><strong>Since 1924</strong>, this Maratha-style \"Military Hotel\" in Jayanagar has been serving meat lovers with unmatched authenticity. It is one of the oldest and most legendary spots for <strong>Donne Biryani</strong>.</p><p>Must-try: Their <strong>Mutton Donne Biryani</strong>, which is herbal, minty, and spicy. Also, don't miss the <strong>Mutton Dry</strong> and <strong>Chicken Leg</strong> fry.</p>",
      "image": "https://img-cdn.publive.online/fit-in/640x430/filters:format(webp)/english-betterindia/media/post_attachments/uploads/2021/01/shivaji-1.jpg",
      "location": "https://maps.google.com/?q=Shivaji+Military+Hotel+Jayanagar+Bengaluru"
    },
    "chikpete-donne-biryani": {
      "id": "chikpete-donne-biryani",
      "name": "Chikpete Donne Biryani",
      "description": "<p>A household name for <strong>Donne Biryani</strong> lovers, this place captures the soul of Chickpet’s narrow culinary lanes. It's famous for its rustic, green-masala infused rice.</p><p>Must-try: The <strong>Chicken Donne Biryani</strong> served with a spicy gravy and raita. It's known for its consistent taste and traditional preparation.</p>",
      "image": "https://travelghat.com/wp-content/uploads/2022/11/Jayanagar-CDBH-image.jpg",
      "location": "https://maps.google.com/?q=Chikpete+Donne+Biryani+Bengaluru"
    },
    "sgs-gundu-palav": {
      "id": "sgs-gundu-palav",
      "name": "SGS Non Veg Gundu Palav",
      "description": "<p>Founded in 1989, <strong>SGS Gundu Palav</strong> in Chickpet is legendary for its unique \"Gundu Palav\" made with short-grain rice and traditional Kshatriya flavors.</p><p>Must-try: The <strong>Chicken Pulav</strong> served on a banana leaf (donne) and the incredibly spicy <strong>Chicken Kshatriya</strong> (deep-fried chicken).</p>",
      "image": "https://content.jdmagicbox.com/v2/comp/bangalore/d8/080pxx80.xx80.171219120031.g5d8/catalogue/sgs-non-veg-gundu-pulav-nagarbhavi-bangalore-biryani-restaurants-hcubjy6xl7.jpg",
      "location": "https://maps.google.com/?q=SGS+Non+Veg+Gundu+Palav+Chickpet+Bengaluru"
    },
    "thoms-bakery": {
      "id": "thoms-bakery",
      "name": "Thom's Bakery",
      "description": "<p>An iconic Frazer Town landmark since 1970, <strong>Thom's Bakery</strong> is where nostalgia meets flavor. It's a favorite for its old-school charm and fresh bakes.</p><p>Must-try: Their legendary <strong>Plum Cake</strong>, <strong>Mutton Samosas</strong>, and the <strong>Spicy Chicken Bun</strong>.</p>",
      "image": "https://lh3.googleusercontent.com/LbYDrLuc2mAuxPcZBAWceRFW1O8uRbyx-vTVg7jKEO5V6mDm0jHiAoRxCTYje0yx7MRCaQ2wHXmtXjaHSQ6dMPi26KkU=w1200-rw",
      "location": "https://maps.google.com/?q=Thom's+Bakery+Frazer+Town+Bengaluru"
    },
    "og-variar": {
      "id": "og-variar",
      "name": "O.G. Variar & Sons",
      "description": "<p>Established in 1954, this Rajajinagar bakery is synonymous with the best biscuits in Bengaluru. They don't use artificial additives, making their bakes pure and delicious.</p><p>Must-try: <strong>Milk Biscuits</strong>, <strong>Kara Biscuits</strong> (spicy), and their exceptionally crispy <strong>Rusk</strong> and <strong>Plum Cake</strong>.</p>",
      "image": "https://indialocaldirectory.com/wp-content/uploads/2024/03/Variar-Bakery-2.jpg",
      "location": "https://maps.google.com/?q=O.G.+Variar+&+Sons+Rajajinagar+Bengaluru"
    },
    "albert-bakery": {
      "id": "albert-bakery",
      "name": "Albert Bakery",
      "description": "<p>Operating since 1902 on Mosque Road, <strong>Albert Bakery</strong> is a historic gem famous for its unique communal bakes and Ramzan specials.</p><p>Must-try: The famous <strong>Khova Naan</strong> and the legendary <strong>Bheja Puff</strong> (Goat Brain Puff), a weekend specialty.</p>",
      "image": "https://imgmediagumlet.lbb.in/media/2022/04/624f06c2e1ac4d1a16c31e21_1649346242645.jpg",
      "location": "https://maps.google.com/?q=Albert+Bakery+Frazer+Town+Bengaluru"
    },
    "vv-puram-street": {
      "id": "vv-puram-street",
      "name": "VV Puram Food Street",
      "description": "<p>Known as <strong>Thindi Beedi</strong>, this is the ultimate destination for vegetarian street food lovers. It's a buzzing lane filled with diverse aromas and flavors.</p><p>Must-try: <strong>Capsicum Bajji</strong>, <strong>Dabeli</strong>, and the unique <strong>Avarekalu</strong> (hyacinth beans) specialties during the season.</p>",
      "image": "https://media.assettype.com/deccanherald%2Fimport%2Fsites%2Fdh%2Ffiles%2Farticleimages%2F2022%2F12%2F23%2Ffile7o24t9c4hdvvls01gri-1174266-1671748031.jpg?w=undefined&auto=format%2Ccompress&fit=max",
      "location": "https://maps.google.com/?q=VV+Puram+Food+Street+Bengaluru"
    },
    "vijaynagar-street": {
      "id": "vijaynagar-street",
      "name": "Vijaynagar Food Street",
      "description": "<p>A vibrant hub for late-night foodies, the <strong>Vijaynagar Food Street</strong> offers a wide array of street food options from Dosas to Gobi Manchurian.</p><p>Must-try: The various types of <strong>Street Dosas</strong> and the spicy <strong>Egg Rice</strong> variants found here.</p>",
      "image": "https://i.ytimg.com/vi/7aosgB3IWyo/maxresdefault.jpg",
      "location": "https://maps.google.com/?q=Vijaynagar+Food+Street+Bengaluru"
    },
    "madhavan-park-bajji": {
      "id": "madhavan-park-bajji",
      "name": "Madhavan Park Bajji Shop",
      "description": "<p>A Jayanagar legend, this humble roadside shop is famous for serving the crispest and most flavorful bajjis in the neighborhood for decades.</p><p>Must-try: <strong>Mirchi Bajji</strong> and <strong>Potato Bajji</strong> served with their signature spicy green chutney.</p>",
      "image": "https://i.ytimg.com/vi/CdrMVixNmOg/maxresdefault.jpg",
      "location": "https://maps.google.com/?q=Madhavan+Park+Bajji+Shop+Jayanagar+Bengaluru"
    },
    "karnataka-bhel-house": {
      "id": "karnataka-bhel-house",
      "name": "Karnataka Bhel House",
      "description": "<p>Since 1975, this place has been the gold standard for Bengaluru-style chaats. It's particularly famous for staying true to its original recipes.</p><p>Must-try: The iconic <strong>Masala Puri</strong> with its thick, spicy pea gravy and firm, crunchy puris.</p>",
      "image": "https://b.zmtcdn.com/data/pictures/1/57331/2e0c64e0f7bac7e5bdadf1acaf558950.jpg",
      "location": "https://maps.google.com/?q=Karnataka+Bhel+House+Basavanagudi+Bengaluru"
    },
    "corner-house": {
      "id": "corner-house",
      "name": "Corner House",
      "description": "<p>No trip to Bengaluru is complete without a visit to <strong>Corner House</strong>. It's an institution that has satisfied the city's sweet tooth for generations.</p><p>Must-try: The legendary <strong>Death By Chocolate (DBC)</strong>—a heavenly mix of ice cream, cake, and warm fudge—and the <strong>Hot Chocolate Fudge</strong>.</p>",
      "image": "https://mindtrip.ai/cdn-cgi/image/format=webp,w=720/https://images.mindtrip.ai/restaurants/644b/b5a3/aaf5/aaae/31c5/288d/10c7/cb91",
      "location": "https://maps.google.com/?q=Corner+House+Ice+Creams+Bengaluru"
    },
    "milano-gelato": {
      "id": "milano-gelato",
      "name": "Milano Ice Cream",
      "description": "<p>Offering a touch of Italy in Bengaluru, <strong>Milano</strong> is famous for its authentic, artisan gelato made with high-quality, fresh ingredients.</p><p>Must-try: Their <strong>Dark Chocolate Sorbet</strong> and the creamy <strong>Pistachio Gelato</strong>.</p>",
      "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgY3w8wS0UfGKAzxUmE4O2XYORxQRC00Mzy-mQJDvNUrPZD_SQEzfM6a7j1BX2NA250Hy2qXIJr_AbpUuTNsOen695SL2wb5ejlAsUn3LvVg_5oshxG0cPQnOKnAOD7Hjnx-zD3gP6g4Hfy/s1600/1.jpg",
      "location": "https://maps.google.com/?q=Milano+Ice+Cream+Indiranagar+Bengaluru"
    },
    "lake-view-milk-bar": {
      "id": "lake-view-milk-bar",
      "name": "Lake View Milk Bar",
      "description": "<p>A heritage establishment on MG Road since 1930, <strong>Lake View</strong> is one of the oldest ice cream parlors in the city, retaining its classic charm.</p><p>Must-try: <strong>Classic Chocolate Shake</strong> and their range of <strong>Vintage Sundaes</strong>.</p>",
      "image": "https://im.whatshot.in/img/2020/Mar/lk11-1583056504.jpg",
      "location": "https://maps.google.com/?q=Lake+View+Milk+Bar+MG+Road+Bengaluru"
    },
    "mani-dum-biryani": {
      "id": "mani-dum-biryani",
      "name": "Mani Dum Biryani",
      "description": "<p>Famous for the <strong>Hoskote-style Mutton Biryani</strong>, this place is worth the early morning trip. It's known for its light but flavorful aromatic profile.</p><p>Must-try: The <strong>Mutton Biryani</strong> served with a simple but punchy raita. The meat is exceptionally tender.</p>",
      "image": "https://b.zmtcdn.com/data/pictures/7/18627637/81dfe349ab5d8c15d688b22ac28d97a7.jpg",
      "location": "https://maps.google.com/?q=Mani+Dum+Biryani+Bengaluru"
    },
    "mallika-biryani": {
      "id": "mallika-biryani",
      "name": "Mallika Biryani",
      "description": "<p>Offering an authentic rural taste, <strong>Mallika Biryani</strong> is a favorite for those who love bold, unpretentious flavors and rustic preparations.</p><p>Must-try: The <strong>Mutton Donne Biryani</strong> and the <strong>Chilly Chicken</strong> which is a perfect spicy companion.</p>",
      "image": "https://images.slurrp.com/prodrich_article/kqiprcptgt.webp?impolicy=slurrp-20210601&width=1200&height=675",
      "location": "https://maps.google.com/?q=Mallika+Biryani+Bengaluru"
    },
    "sharif-bhai": {
      "id": "sharif-bhai",
      "name": "Sharif Bhai Biryani",
      "description": "<p>Celebrating the Nawabi culinary heritage, <strong>Sharif Bhai</strong> offers fine biryani and traditional Mughlai-style delicacies with a focus on mutton.</p><p>Must-try: The <strong>Mutton Dum Biryani</strong> and their melt-in-the-mouth <strong>Harsha Seekh Kababs</strong>.</p>",
      "image": "https://restaurantindia.s3.ap-south-1.amazonaws.com/s3fs-public/2025-06/gbth4g845h84h.jpg",
      "location": "https://maps.google.com/?q=Sharif+Bhai+Biryani+Bengaluru"
    },
    "hotel-sagar": {
      "id": "hotel-sagar",
      "name": "Hotel Sagar",
      "description": "<p>A Rajajinagar landmark, <strong>Hotel Sagar</strong> is legendary for its fresh fruit preparations and specifically its year-round mango milkshake.</p><p>Must-try: The iconic <strong>Mango Milkshake</strong>—thick, creamy, and topped with generous cubes of fresh Alphonso mango.</p>",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/37/a1/df/20190413-175055-largejpg.jpg?w=1200&h=1200&s=1",
      "location": "https://maps.google.com/?q=Hotel+Sagar+Rajajinagar+Bengaluru"
    },
    "brahmins-thatte-idli": {
      "id": "brahmins-thatte-idli",
      "name": "Brahmins Thatte Idli",
      "description": "<p>Famous for the flat, plate-sized \"Thatte Idli\", this place serves super soft idlis that are a favorite for breakfast lovers across the city.</p><p>Must-try: The <strong>Thatte Idli</strong> served with a huge dollop of butter and their signature spicy red chutney.</p>",
      "image": "https://dineout-media-assets.swiggy.com/swiggy/image/upload/fl_lossy,f_auto,q_auto/v1708012809/5d941cf1f905e444a3301849d12b6e5e.png",
      "location": "https://maps.google.com/?q=Brahmins+Thatte+Idli+Bengaluru"
    },
    "bidadi-thatte-idli": {
      "id": "bidadi-thatte-idli",
      "name": "Bidadi Thatte Idli",
      "description": "<p>The original highway snack stop! Bidadi is the birthplace of the <strong>Thatte Idli</strong>, and these roadside stops are a must-visit for travelers.</p><p>Must-try: The <strong>Thatte Idli</strong> served with Vada and spicy sambar. It's the ultimate comfort food on the road.</p>",
      "image": "https://i0.wp.com/yummraj.com/wp-content/uploads/2017/07/img_2865.jpg?ssl=1",
      "location": "https://maps.google.com/?q=Bidadi+Thatte+Idli+Bengaluru"
    },
    "rameshwaram-cafe": {
      "id": "rameshwaram-cafe",
      "name": "The Rameshwaram Cafe",
      "description": "<p>A modern powerhouse in the tiffin scene, <strong>Rameshwaram Cafe</strong> is famous for its ghee-laden, incredibly crispy and flavorful South Indian staples.</p><p>Must-try: Their <strong>Ghee Podi Thatte Idli</strong> and the legendary <strong>Ghee Roast Dosa</strong>.</p>",
      "image": "https://b.zmtcdn.com/data/pictures/2/19911292/8cf509b8019924f642e279e342a5cebc.jpg",
      "location": "https://maps.google.com/?q=The+Rameshwaram+Cafe+Bengaluru"
    },
    "karavalli": {
      "id": "karavalli",
      "name": "Karavalli",
      "description": "<p>One of the finest coastal dining experiences in the country. Located in Vivanta, it celebrates the seafood traditions of the South West coast.</p><p>Must-try: <strong>Tiger Prawns Roast</strong>, <strong>Appams</strong> with stew, and the <strong>Koli Barthad</strong>.</p>",
      "image": "https://cdn.tasteatlas.com/images/restaurants/ba60c8446f5a4d4796a36d059ed92541.jpg?w=600",
      "location": "https://maps.google.com/?q=Karavalli+Vivanta+Bengaluru"
    },
    "fishermans-wharf": {
      "id": "fishermans-wharf",
      "name": "The Fisherman's Wharf",
      "description": "<p>Bringing the spirit of Goa to Bengaluru with its vibrant decor and live music. It's a great place for premium coastal and global seafood.</p><p>Must-try: <strong>Goan Prawn Curry</strong>, <strong>Pomfret Recheado</strong>, and their legendary <strong>Bebinca</strong>.</p>",
      "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2f/86/e5/2b/goan-charm-in-bangalore.jpg?w=900&h=500&s=1",
      "location": "https://maps.google.com/?q=The+Fisherman's+Wharf+Bengaluru"
    },
    "raja-gobi": {
      "id": "raja-gobi",
      "name": "Raja Gobi",
      "description": "<p>A legend of JP Nagar, this cart is where the city's love for <strong>Gobi Manchurian</strong> reached its peak. It's consistently rated as the best in town.</p><p>Must-try: The <strong>Crispy Gobi Manchurian</strong>—spicy, tangy, and perfectly fried. It's a street food masterpiece.</p>",
      "image": "https://content.jdmagicbox.com/v2/comp/bangalore/q2/080pxx80.xx80.180828084731.g5q2/catalogue/gobi-corner-rajajinagar-bangalore-fast-food-lS7BZsKUph.jpg",
      "location": "https://maps.google.com/?q=Raja+Gobi+JP+Nagar+Bengaluru"
    },
    "uncle-egg-rice": {
      "id": "uncle-egg-rice",
      "name": "Uncle Egg Rice Corner",
      "description": "<p>A late-night haven for college students and office goers. Reliable, spicy, and incredibly satisfying street-style egg rice.</p><p>Must-try: <strong>Special Egg Rice</strong> and <strong>Egg Noodles</strong> with an extra dash of their secret spice mix.</p>",
      "image": "https://i.ytimg.com/vi/57tmSk3Oi04/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLDwt90cDPoZbunVD74pMYyZnv6fRw",
      "location": "https://maps.google.com/?q=Uncle+Egg+Rice+Corner+Bengaluru"
    },
    "snehajeevi-egg-rice": {
      "id": "snehajeevi-egg-rice",
      "name": "Snehajeevi Gowdara EggRice Adda",
      "description": "<p>A Malleshwaram landmark for egg rice enthusiasts. It's known for its authentic, homely but spicy preparation that keeps people coming back.</p><p>Must-try: The <strong>Masala Egg Rice</strong> and <strong>Omelet</strong>. It's comfort food at its best.</p>",
      "image": "https://i.ytimg.com/vi/aiuXywSMomc/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLBiAluEsAFZJeiDo03rU_xMoohhBw",
      "location": "https://maps.google.com/?q=Snehajeevi+Gowdara+EggRice+Adda+Bengaluru"
    },
    "egg-corner-vijayanagar": {
      "id": "egg-corner-vijayanagar",
      "name": "Egg Corner",
      "description": "<p>Located in the food-rich Vijayanagar area, this corner shop specializes in a variety of egg-based street foods that are bold and flavorful.</p><p>Must-try: <strong>Egg Fried Rice</strong> and <strong>Chicken Keema Egg Rice</strong>. Perfect for a quick, filling meal.</p>",
      "image": "https://content3.jdmagicbox.com/v2/comp/bangalore/v5/080pxx80.xx80.220125012437.n6v5/catalogue/egg-point-vijayanagar-bangalore-street-food-7xuozdmv4h.jpg",
      "location": "https://maps.google.com/?q=Egg+Corner+Vijayanagar+Bengaluru"
    },
    "jagli-thindi": {
      "id": "jagli-thindi",
      "name": "Jagli Thindi",
      "description": "<p>Specializing in authentic Dakshina Kannada cuisine, <strong>Jagli Thindi</strong> is famous for its unique traditional steaming methods and serving style.</p><p>Must-try: <strong>Kotte Kadubu</strong> (Idli steamed in jackfruit leaves) or <strong>Coconut Shell Idli</strong>. It's served on a \"Jagli\" (traditional platform) for an authentic feel.</p>",
      "image": "https://lh3.googleusercontent.com/c-XhwLUnt2twQlHlyVq3dtUPaRtT4d7P1Ff2MZ-XNgxtITu68oo_CveYd05STFj437KvlW25Ll1OQonmhSs9yPrDk2T_VHIXT2U8EPao=w1200-rw",
      "location": "https://maps.google.com/?q=Jagli+Thindi+Bengaluru"
    },
    "hatti-kaapi": {
      "id": "hatti-kaapi",
      "name": "Hatti Kaapi",
      "description": "<p>Starting as a small outlet in Gandhi Bazaar in 2009, <strong>Hatti Kaapi</strong> (meaning \"House Coffee\" in local dialect) has grown into a chain that champions authentic Indian filter coffee culture.</p><p>They serve traditional filter coffee brewed to perfection in brass tumblers. Beyond coffee, they are known for their snack pairings like bun-maska and traditional biscuits. It provides a more contemporary yet authentic setting compared to the old-school stand-up bars.</p>",
      "image": "https://www.saffrontrail.com/wp-content/uploads/2006/08/recipe-to-make-filter-kaapi-how-to.1024x1024.jpg",
      "location": "https://maps.google.com/?q=Hatti+Kaapi+MG+Road+Bengaluru"
    }
  },
  "dishes": {
    "masala-dosa": {
      "id": "masala-dosa",
      "name": "Masala Dosa",
      "description": "Dosa is a popular South Indian dish made from fermented rice and lentil batter, known for its crispy texture and delicious taste. It is commonly served with chutney and sambar.",
      "image": "https://images.unsplash.com/photo-1694849789325-914b71ab4075?q=80&w=1074&auto=format&fit=crop",
      "restaurants": ["mtr", "ctr", "vidyarthi-bhavan"]
    },
    "bisi-bele-bath": {
      "id": "bisi-bele-bath",
      "name": "Bisi Bele Bath",
      "description": "A wholesome 'hot lentil rice' dish made with rice, lentils, vegetables, and a complex spice blend featuring tamarind and jaggery. It's a cornerstone of Karnataka's culinary heritage.",
      "image": "https://media.istockphoto.com/id/1221366840/photo/bisibele-bath-hot-lentil-rice-dish.jpg?s=2048x2048&w=is&k=20&c=FxazAaOB-H_m5TltTM00njyObU99pP0BhrRcNBCIrZw=",
      "restaurants": ["mtr", "halli-mane", "maiyas"]
    },
    "biryani": {
      "id": "biryani",
      "name": "Biryani",
      "description": "Biryani is a go-to comfort food for non veg lovers, made with fragrant rice, tender meat, and rich spices slow-cooked to perfection. From spicy Hyderabadi styles to Bengaluru’s famous Donne biryani, every plate is packed with deep flavors, hearty portions, and pure comfort.",
      "image": "https://images.unsplash.com/photo-1589302168068-964664d93dc0?w=600&auto=format&fit=crop",
      "restaurants": ["meghana-foods", "nagarjuna", "rnr-biryani"]
    },
    "ragi-mudde": {
      "id": "ragi-mudde",
      "name": "Ragi Mudde",
      "description": "Nutritious finger millet balls, a staple of Old Mysore region's agricultural roots. Traditionally served with spicy saaru or bassaru and known for incredible health benefits.",
      "image": "https://www.cookwithkushi.com/wp-content/uploads/2015/09/easy_ragi_mudde_recipe.jpg",
      "restaurants": ["mudde-madappa", "halli-mane", "kamat-lokaruchi"]
    },
    "idli-vada": {
      "id": "idli-vada",
      "name": "Idli Vada",
      "description": "Idli and Vada are a soulful morning ritual — cloud-soft idlis that melt in your mouth, paired with crisp, golden vadas with a gentle crunch. Served with aromatic sambar and freshly ground chutneys,this comforting duo captures the true essence of South Indian breakfast culture.",
      "image": "https://media.istockphoto.com/id/2223331687/photo/delicious-south-indian-breakfast-food-idli-and-vada.jpg?s=2048x2048&w=is&k=20&c=yzKvLYrr2AAoMsFJJ24IStRoxvGX6EsPw7D8BOq0Y20=",
      "restaurants": ["brahmins-coffee-bar", "veena-stores", "taaza-thindi"]
    },
    "filter-coffee": {
      "id": "filter-coffee",
      "name": "Filter Coffee",
      "description": "The aromatic heartbeat of Bengaluru's mornings.",
      "image": "https://www.saffrontrail.com/wp-content/uploads/2006/08/recipe-to-make-filter-kaapi-how-to.1024x1024.jpg",
      "restaurants": ["indian-coffee-house", "by-2-coffee", "koshys"]
    },
    "donne-biryani": {
      "id": "donne-biryani",
      "name": "Donne Biryani",
      "description": "Aromatic, green-masala biryani served in traditional eco-friendly leaf bowls.",
      "image": "https://media-assets.swiggy.com/swiggy/image/upload/f_auto,q_auto,fl_lossy/cpbq1uck4icuhdqvuwb0",
      "restaurants": [
        "shivaji-military-hotel",
        "chikpete-donne-biryani",
        "sgs-gundu-palav"
      ]
    },
    "bakery": {
      "id": "bakery",
      "name": "Iconic Bakeries",
      "description": "Centuries-old legacy bakes from plum cakes to spicy puffs.",
      "image": "https://images.ctfassets.net/rric2f17v78a/1ql70crfzaiw9nFd58CZ7p/04652a19ab2fe5a5370d92c7957eb016/open-a-bakery-header.jpg",
      "restaurants": ["thoms-bakery", "og-variar", "albert-bakery"]
    },
    "street-food": {
      "id": "street-food",
      "name": "Street Food Streets",
      "description": "The buzzing 'Thindi Beedis' of the city, serving localized vegetarian delights.",
      "image": "https://nammabengaluru332470244.wordpress.com/wp-content/uploads/2021/06/emuehgdu8aaetfe.jpg",
      "restaurants": [
        "vv-puram-street",
        "vijaynagar-street",
        "madhavan-park-bajji"
      ]
    },
    "masala-puri": {
      "id": "masala-puri",
      "name": "Masala Puri",
      "description": "The ultimate Bengaluru street snack—spicy green pea gravy over crushed puris.",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTF-e43ff8tsaeUIMmFcK83xp3KDSybo_1L6Q&s",
      "restaurants": ["karnataka-bhel-house"]
    },
    "ice-cream": {
      "id": "ice-cream",
      "name": "Ice Cream Parlors",
      "description": "From heritage sundaes to artisan gelatos.",
      "image": "https://www.keep-calm-and-eat-ice-cream.com/wp-content/uploads/2022/08/Ice-cream-sundae-hero-11.jpg",
      "restaurants": ["corner-house", "milano-gelato", "lake-view-milk-bar"]
    },
    "mutton-biryani": {
      "id": "mutton-biryani",
      "name": "Mutton Biryani",
      "description": "Bold, rustic, and aromatic mutton biryanis from Hoskote to the city center.",
      "image": "https://media.istockphoto.com/id/980037112/photo/gosht-or-lamb-biryani-prepared-in-basmati-rice-served-with-yogurt-dip-in-terracotta-bowl.jpg?s=612x612&w=0&k=20&c=LY0r5y0tij9MHz2tg802UQGHk-VPUNUYj6x6qGm2bsU=",
      "restaurants": ["mani-dum-biryani", "mallika-biryani", "sharif-bhai"]
    },
    "mango-milkshake": {
      "id": "mango-milkshake",
      "name": "Mango Milkshake",
      "description": "Creamy, thick, and topped with fresh fruit—available all year round.",
      "image": "https://im.whatshot.in/img/2023/May/sagar-hotel-cropped-1684303283.jpg?wp=1",
      "restaurants": ["hotel-sagar"]
    },
    "thatte-idli": {
      "id": "thatte-idli",
      "name": "Thatte Idli",
      "description": "Famous 'Plate Idlis'—extra soft, flat, and served with a dollop of butter.",
      "image": "https://b.zmtcdn.com/data/dish_photos/9bd/3128056e0839391effbdc76caa20a9bd.jpg",
      "restaurants": [
        "brahmins-thatte-idli",
        "bidadi-thatte-idli",
        "rameshwaram-cafe"
      ]
    },
    "coastal-food": {
      "id": "coastal-food",
      "name": "Coastal Delights",
      "description": "Fresh seafood traditions from the South West coast of India.",
      "image": "https://www.stayvista.com/blog/wp-content/uploads/2025/04/24815896422_e6bfdcb816_b.jpg",
      "restaurants": ["karavalli", "fishermans-wharf"]
    },
    "gobi": {
      "id": "gobi",
      "name": "Gobi Manchurian",
      "description": "The city's favorite indo-chinese snack—crispy, tangy, and spicy.",
      "image": "https://purendesi.in/wp-content/uploads/2024/05/Gobi-Manchurian-Recipe.jpg",
      "restaurants": ["raja-gobi"]
    },
    "egg-rice": {
      "id": "egg-rice",
      "name": "Egg Rice",
      "description": "The ultimate late-night street food staple of Bengaluru.",
      "image": "https://www.cookwithkushi.com/wp-content/uploads/2024/02/egg_rice_pulao_lunchbox_recipe_ideas.jpg",
      "restaurants": [
        "uncle-egg-rice",
        "snehajeevi-egg-rice",
        "egg-corner-vijayanagar"
      ]
    },
    "special-idli": {
      "id": "special-idli",
      "name": "Traditional Idli Varieties",
      "description": "Unique idlis steamed in jackfruit leaves and coconut shells.",
      "image": "https://i.ytimg.com/vi/RzGHA5ULnSU/maxresdefault.jpg",
      "restaurants": ["jagli-thindi"]
    }
  }
}
